---
kind: type
id: T:Autodesk.Revit.DB.Color
zh: 着色、上色、染色、填色
source: html/3735f9b9-d477-09ea-25bd-67f34134595f.htm
---
# Autodesk.Revit.DB.Color

**中文**: 着色、上色、染色、填色

Represents a color in Autodesk Revit.

## Syntax (C#)
```csharp
public class Color : APIObject
```

## Remarks
Colors obtained from some API methods may represent an uninitialized/invalid color. You can identify these
using the IsValid property.